#include <iostream>
#include "common/format.h"
#include "common/print.h"
#include "common/result.h"
#include "common/string.h"
#include "common/utf8.h"

using lr6::Unwrap;

int main() {
  // lr6::String str = u8" 是,shì;4,🤑🤑fksfdhаырвпрывпо不,";
  // str.Append(u8"🤑");
  // str.Append(u8"гпрыпыаврполавлопав");
  // str.Append(
  //     u8"ываиывоаывпигывргвыплрывлпрыовроыврагшуигмикгшкипгшигишгыимгыимовиыгом"
  //     u8"иыолвимлоывиомывиомиывромрыввиоп "
  //     u8"انه قدما أحكم إبّان بـ. جهة الله بهيئة موالية كل. هذا الأرض وبعدما "
  //     u8"الإقتصادية مع, مسارح يعادل الثالث، قد على. وبغطاء");
  // str.Append(u8"\n");
  // str.Append(
  //     u8"玩旦乾五人花躲聲燈具跳日水詞經。太習晚多幫黑蝸員良二十得向喜首對候占行"
  //     u8"品！休目寸婆公鴨主常物風路：蝶幸幼雲昔那尺向身？占意這工您固色二哥英久"
  //     u8"青頁筆今植！西牙讀棵。聲草嗎胡衣士道經牛個今民飽肖種牠內外急乙。乞送冬"
  //     u8"鳥植，朋雲經國子戊封，牠澡帶隻吉科升固貓肉，尾喝買定麻羊虎乞玉但己鳥斗"
  //     u8"色人帽冬犬到布！找太心，陽叫村身頭朋首肉一去丟歌生告許甲都燈公實：品冬"
  //     u8"壯。香像旦雲什寸許四進荷要道。她游交知也果何後交鴨者冰實、南東高來跑別"
  //     u8"每說服訴果跳米草中苗，平斤課方弓不汁牙說公朋朋枝？得東位止力央泉朵到多"
  //     u8"抓假封西：二牛坡手定父位馬方追。人了西要且加彩遠讀者追畫弟。林發已您世"
  //     u8"息，二兄友語昔天五；對怕英耳位亮追香員十吉加事蝸黃已貓；几連而男點兩民"
  //     u8"！錯午下戊神。止又勿立苦點火綠司母夏追車母但晚、課女秋意條日乙前那停羊"
  //     u8"高息助葉衣月，鼻才國、次兒苦馬雞門它；右請尺辛首公冬葉以笑小東，者次校"
  //     u8"，羊吃下因前點。筆尼師蝸未耳細穴斥尤松乞水次民高「快跳米出圓它」跟坡刀"
  //     u8"往村真世每米牠但貫；氣欠哥請內別南旁掃回下至把肖物刀「天送亮二一爸您五"
  //     u8"心」。");

  // for (auto c : str.Chars()) {
  //   std::cout << c;
  // }
  // std::cout << '\n';

  lr6::PrintLine("This is {0}!", lr6::Red(42));

  return 0;
}